UKS/src/Documents/ЗаявкаНаРемонт/ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРемонт</name>
  <registerRecords>InformationRegister.СостояниеРемонта</registerRecords>
  <registerRecords>InformationRegister.РегистрВыполненыхРабот</registerRecords>
  <attributes>
    <name>ВнутНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнившийСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачиРемонта</name>
    <type>
      <types>EnumRef.СостояниеРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискИнвентарныйНомер</name>
    <comment>Инвентарный номер оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиОтработаноеВремяЧасов</name>
    <comment>Время потрачеоное на работу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиОтработаноеВремяМинут</name>
    <comment>Время потрачеоное на работу минут</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

UKS/src/InformationRegisters/СостояниеРемонта/СостояниеРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРемонта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кабинет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/InformationRegisters/РегистрВыполненыхРабот/РегистрВыполненыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрВыполненыхРабот</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеРешения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасов</name>
    <comment>Количество отработанных часов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМинут</name>
    <comment>Количество отработанных минут</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВыполнившийСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Documents/ЗаявкаНаРемонт/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СостояниеРемонта.Записывать = Истина;
	Движение = Движения.СостояниеРемонта.Добавить();
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	Движение.Сотрудник = Сотрудник;
	Движение.Кабинет = Кабинет;
	Движение.ОписаниеПроблемы = ОписаниеПроблемы;

	Движения.РегистрВыполненыхРабот.Записывать = Истина;
	Движение = Движения.РегистрВыполненыхРабот.Добавить();
	Движение.Период = Дата;
	Движение.ДатаПринятия = ДатаПринятия;
	Движение.ВыполнившийСотрудник = ВыполнившийСотрудник;
	Движение.ДатаВыполнения = ДатаВыполнения;
	Движение.ОписаниеРешения = ОписаниеРешения;
	Движение.КоличествоЧасов = ФактическиОтработаноеВремяЧасов;
	Движение.КоличествоМинут = ФактическиОтработаноеВремяМинут;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//ЗаписьЖурналаРегистрации("Документ.ЗаявкаНаРемонт",УровеньЖурналаРегистрации.Информация,Ссылка,Ссылка,"Компьютер: "+ИмяКомпьютера());
	
КонецПроцедуры
